ci4/app/Controllers/Post.php

  public function show($id = null)
  {

    $model = new ArtikelModel();
    $data = $model->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '16'
 LIMIT 1

  public function delete($id = null)
  {
    $model = new ArtikelModel();
    $data = $model->where('id', $id)->delete($id);
    if ($data) {
      $model->delete($id);
---
DELETE FROM `artikel`
WHERE `id` = '16'
AND `id` IN ('16')
DELETE FROM `artikel`
WHERE `id` IN ('16')